src/Documents/Receipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>Receipt</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RefNum</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DepositType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Deposited</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.PurchaseReturn</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Payment</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Due</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DueFCY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccountingRegisters/GeneralJournal.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccountingRegister>
		<Properties>
			<Name>GeneralJournal</Name>
			<ChartOfAccounts>ChartOfAccounts.ChartOfAccounts</ChartOfAccounts>
			<Correspondence>false</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/Documents/Receipt/Ext/ObjectModule.bsl
// The procedure posts a receipt document. Different transactions are creating depending whether the deposit type is
// 1 for an undeposited funds account, and 2 for a bank account, also an FX gain or loss is calculated and posted.
//
Procedure Posting(Cancel, PostingMode)
		
	For Each DocumentLine In LineItems Do
	
		DocumentObject = DocumentLine.Document.GetObject();
		
		ExchangeRate = GeneralFunctions.GetExchangeRate(Date, GeneralFunctionsReusable.DefaultCurrency(), DocumentObject.Currency);
		 
		RegisterRecords.GeneralJournal.Write = True;
		
		If TypeOf(DocumentObject.Ref) = Type("DocumentRef.SalesInvoice") Then
		
			Record = RegisterRecords.GeneralJournal.AddCredit();
			Record.Account = DocumentObject.ARAccount;
			Record.Period = Date;
			Record.Amount = DocumentLine.Payment;
			Record.AmountRC = DocumentLine.Payment * DocumentObject.ExchangeRate;
			Record.Currency = DocumentObject.Currency;
			Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Company] = Company;
			Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Document] = DocumentObject.Ref;
			
			If DepositType = "1" Then 
			 
				Record = RegisterRecords.GeneralJournal.AddDebit();
				Record.Account = Constants.UndepositedFundsAccount.Get();
				Record.Period = Date;
				Record.AmountRC = DocumentLine.Payment * ExchangeRate;
						 
			EndIf;

		 
			If DepositType = "2" Then 
		 
				Record = RegisterRecords.GeneralJournal.AddDebit();
				Record.Account = BankAccount;
				Record.Currency = BankAccount.Currency;
				Record.Period = Date;				
				If DocumentObject.Currency = BankAccount.Currency Then
					Record.Amount = DocumentLine.Payment;
				Else
					Record.Amount = DocumentLine.Payment * ExchangeRate;
				EndIf;
				Record.AmountRC = DocumentLine.Payment * ExchangeRate;
				 	 
	 		EndIf;
			
		Else
		EndIf;
		
		If TypeOf(DocumentObject.Ref) = Type("DocumentRef.PurchaseReturn") Then
			
			Record = RegisterRecords.GeneralJournal.AddCredit();
			Record.Account = DocumentObject.APAccount;
			Record.Period = Date;
			Record.Amount = DocumentLine.Payment;
			Record.AmountRC = DocumentLine.Payment * DocumentObject.ExchangeRate;
			Record.Currency = DocumentObject.Currency;
			Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Company] = Company;
			Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Document] = DocumentObject.Ref;
			
			If DepositType = "1" Then 
			 
				Record = RegisterRecords.GeneralJournal.AddDebit();
				Record.Account = Constants.UndepositedFundsAccount.Get();
				Record.Period = Date;
				Record.AmountRC = DocumentLine.Payment * ExchangeRate;
						 
			EndIf;

			If DepositType = "2" Then
			
				Record = RegisterRecords.GeneralJournal.AddDebit();
				Record.Account = BankAccount;
				Record.Currency = BankAccount.Currency;
				Record.Period = Date;
				If DocumentObject.Currency = BankAccount.Currency Then
					Record.Amount = DocumentLine.Payment;
				Else
					Record.Amount = DocumentLine.Payment * ExchangeRate;
				EndIf;
				Record.AmountRC = DocumentLine.Payment * ExchangeRate;
			
			EndIf;
					 			
		Else
		EndIf;
						
		FXGainLoss = (ExchangeRate - DocumentObject.ExchangeRate) * DocumentLine.Payment;
		 
		If FXGainLoss > 0 Then
			
			Record = RegisterRecords.GeneralJournal.AddCredit();
			Record.Account = Constants.ExchangeGain.Get();
			Record.Period = Date;
			Record.AmountRC = FXGainLoss;
			
						
		Else
	    	If FXGainLoss < 0 Then
				
				Record = RegisterRecords.GeneralJournal.AddDebit();
				Record.Account = Constants.ExchangeLoss.Get();
				Record.Period = Date;
				Record.AmountRC = FXGainLoss * -1;
				
				 				
	    	Else
	    	EndIf;
	    EndIf;
		
	EndDo;
	
EndProcedure
